#include <stdio.h>
#include <time.h>
#include <unistd.h>
//関数のプロトタイプを宣言
void printClock(int size, int hour, int min, int sec);

/*注意点
・sizeを大きくしすぎると画面が乱れる.
・sizeを大きくするなら、実行前にコンソールサイズを小さくすること.
・sizeは自然数をにゅうりょくしてください.
・sizeが1倍のとき、サイズ以外の項目は変更することができません.
・コンソールのウインドウを拡大縮小すると画面が乱れることがあります.その際は再起動をお願いします.
*/


/*機能の候補！！！
・ゲーミングカラー
?レイアウトを増やす
・PM/AMを追加する(scanf)
・size2以上のとき、月/日/曜日を追加する(scanf)
・size2以上のとき、秒数を小さくするorなくす(scanf)
・最初に設定項目を追加する(scanf)
・終了方法をかんがえておく
ex.
    変更したい項目の番号を入力してください.
    実行する場合は0を入力してください. //それ以外の数は終了
    0.実行
    1.サイズの変更:*1
    ２.月/日/曜日の表示：有効
    3.秒数の表示:小  //有効/有効(小)/メトロノーム/無効
    入力: 
//size=1に設定された時、秒数以外の以下の項目をすべて無効に
//size=1のとき他の設定の番号を入力しようとすると、警告文と共にループする

*/
//main関数
int main(int argc, const char * argv[]) {
    int size = 1;
    int count = 0;
    time_t t = time(NULL);
    struct tm tm;
    localtime_r(&t, &tm);

    //size設定
    printf("サイズ(倍数)を自然数で入力してください(10倍まで): ");
    scanf("%d", &size);
    printf("size * %d\n",size);
    if (size < 1) return 0;

    //本体
    //sleepをscanf(gamingcolor fast slow)で得た値で、0.2とか0.25とかにする→ゲーミング
    while (1) {
        sleep(1);
        printf("\033[2K");//行全体削除
        time_t t = time(NULL);
        localtime_r(&t, &tm);
        printClock(size, tm.tm_hour, tm.tm_min, tm.tm_sec);
        printf("\033[%dF", 5 * size);//カーソルを5*size行上に移動
        
    }
    return 0;
}



//void printClock(int size, int color, int hour, int min, int sec);
//関数
//引数に数字を入力するとでかくなって出力される。
void printClock(int size, int hour, int min, int sec) {
    
    int data[15] = {hour/10, 11, hour%10, 11, 10, 11, min/10, 11, min%10, 11, 10, 11, sec/10, 11, sec%10};
    //:(10), 空白(11)
    int bigNumberList[12][5][5] = {
        //0
        {
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 1},
        {1, 0, 0, 0, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //1
        {
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        },
        //2
        {
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 0},
        {1, 1, 1, 1, 1},
        },
        //3
        {
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //4
        {
        {1, 0, 0, 0, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        },
        //5
        {
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 0},
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //6
        {
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 0},
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //7
        {
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        },
        //8
        {
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //9
        {
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //:コロン(10)
        {
        {0, 0, 0, 0, 0},
        {0, 0, 1, 0, 0},
        {0, 0, 0, 0, 0},
        {0, 0, 1, 0, 0},
        {0, 0, 0, 0, 0},
        },
        //空白(11)
        {
        {-1, -1, 0, -1, -1},
        {-1, -1, 0, -1, -1},
        {-1, -1, 0, -1, -1},
        {-1, -1, 0, -1, -1},
        {-1, -1, 0, -1, -1},
        }
    };

    //出力
    for (int i = 0; i < 5; i++) {
        //size(縦幅5*size)
        for (int j = 0; j < size; j++) {
            //1行を構成
            for (int k = 0; k < 15; k++) {
                //１文字を構成
                for (int l = 0; l < 5; l++) {
                    //size(横幅5*size)
                    for (int m = 0; m < size; m++) {
                        if(bigNumberList[data[k]][i][l] == 1) {
                            printf("■\033[36m");
                        } else if (bigNumberList[data[k]][i][l] == 0) {
                            putchar(' ');
                        }
                    }
                }
            }
            putchar('\n');
        }
    }
}

//183行赤色に：printf("■\033[31m");