#include <stdio.h>
#include <time.h>
#include <unistd.h>
//関数のプロトタイプを宣言
void printClock(int size, int color, int isAMPM, int year, int month, int day, int week, int hour, int min, int sec);

/*注意点
・sizeを大きくしすぎると画面が乱れる.
・sizeを大きくするなら、実行前にコンソールサイズを小さくすること.
・sizeは自然数をにゅうりょくしてください.
・sizeが1倍のとき、サイズ以外の項目は変更することができません.
・コンソールのウインドウを拡大縮小すると画面が乱れることがあります.その際は再起動をお願いします.
・sizeを大きくしてコンソールサイズを小さくすることをおすすめします
・曜日などはsize変更できません
*/


/*機能の候補！！！
・ゲーミングカラー
?レイアウトを増やす
・[PM/AMを追加する(scanf)
・[size2以上のとき、月/日/曜日を追加する(scanf)]
・[size2以上のとき、秒数を小さくするorなくす(scanf)]
・最初に設定項目を追加する(scanf)
・終了方法をかんがえておく
・曜日が切り替わる時前の表示が残ってる→曜日の後に空白文字をいれればいけるかも？
ex.
    変更したい項目の番号を入力してください.
    実行する場合は0を入力してください. //それ以外の数は終了
    0.実行
    1.サイズの変更:*1
    ２.月/日/曜日の表示：有効
    3.秒数の表示:小  //有効/有効(小)/メトロノーム/無効
    入力: 
//size=1に設定された時、秒数以外の以下の項目をすべて無効に
//size=1のとき他の設定の番号を入力しようとすると、警告文と共にループする

*/
//main関数
int main(int argc, const char * argv[]) {
    int size = 1;
    int color = 0;
    int goUp = 5;
    int isAMPM = 0; //0:無効, 1:有効
    time_t t = time(NULL);
    struct tm tm;
    localtime_r(&t, &tm);

    //size設定
    printf("サイズ(倍数)を自然数で入力してください(10倍まで): ");
    scanf("%d", &size);
    printf("size * %d\n",size);
    if (!(size > 1 || size < 10)) return 0; //実行不可処理 errorMessage()?
    if (size != 1) {
        goUp = size * 5 + 6;//曜日分も底上げ
    }

    //color設定
    printf("サイズを入力してください\n");
    printf("0:白, 1:赤, 2:緑, 3:黄, 4:紫, 5:ピンク, 6:水色\n");
    printf(": ");
    scanf("%d", &color);
    if (color == 0) {
        color = 7;  //\033[37m (37は白)
    }

    //AMPM設定
    printf("AMPM設定\n");
    printf("0/無効, 1/有効\n");
    printf(": ");
    scanf("%d", &isAMPM);
    

    //本体
    //sleepをscanf(gamingcolor fast slow)で得た値で、0.2とか0.25とかにする→ゲーミング
    while (1) {
        sleep(1);//調整のためにいじるかも
        printf("\033[2K");//全体削除
        time_t t = time(NULL);
        localtime_r(&t, &tm);
        printClock(
            size, color, isAMPM,//各種設定
            tm.tm_year+1900, tm.tm_mon+1 ,tm.tm_mday, tm.tm_wday,//年月日曜
            tm.tm_hour, tm.tm_min, tm.tm_sec//時分秒
        );
        printf("\033[%dF", goUp);//カーソルを5*size+6行上に移動
        
    }
    return 0;
}




//関数

//error関数

//{2022/7/14/THU}
//

//引数に数字を入力するとでかくなって出力される。
void printClock(int size, int color, int isAMPM, int year, int month, int day, int week, int hour, int min, int sec) {
    //１段目,時分秒を配列にまとめる ex.{0 1 : 2 3 : 4 5}
    //[10]コロン, [11]空白
    int HMSdata[15] = {
        hour/10, 11, hour%10, 11, 10, 11,//{1 2 : }
        min/10, 11, min%10, 11, 10, 11,//{3 4 : }
        sec/10, 11, sec%10,//{5 6}
    };

    //Wdata[week日0-土6][5]
    int Wdata[7][3] = {
        {23, 25, 19},//日(SUN)
        {18, 20, 19},//月(MON)
        {24, 25, 14},//火(TUE)
        {26, 14, 13},//水(WED)
        {24, 16, 25},//木(THU)
        {15, 22, 17},//金(FRI)
        {23, 12, 24},//土(SAT)
    };

    
    //2段目,年月日曜を配列にまとめる ex.{2 0 2 2 / 0 7 / 1 4 / T H U}
    int YMDWdata[28] = {
        year/1000, 11, year%1000/100, 11, year%100/10, 11, year%10, 11, 27, 11,//{2 0 2 2 / }
        month/10, 11, month%10, 11, 27, 11,//{0 7 / }
        day/10, 11, day%10, 11, 27, 11,//{1 4 / }
        Wdata[week][0], 11, Wdata[week][1], 11, Wdata[week][2], 28//{T H U[ ]}
    };

    //数字と記号1-11, アルファベット12-26, スラッシュ27,空白文字28
    //1:■, 0:空白, -1:詰める
    int bigList[29][5][5] = {
        //[0]0
        {
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 1},
        {1, 0, 0, 0, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //[1]1
        {
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        },
        //[2]2
        {
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 0},
        {1, 1, 1, 1, 1},
        },
        //[3]3
        {
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //[4]4
        {
        {1, 0, 0, 0, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        },
        //[5]5
        {
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 0},
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //[60]6
        {
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 0},
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //[7]7
        {
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        {0, 0, 0, 0, 1},
        },
        //[8]8
        {
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //[9]9
        {
        {1, 1, 1, 1, 1},
        {1, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        {0, 0, 0, 0, 1},
        {1, 1, 1, 1, 1},
        },
        //[10]コロン
        {
        {0, 0, 0, 0, 0},
        {0, 0, 1, 0, 0},
        {0, 0, 0, 0, 0},
        {0, 0, 1, 0, 0},
        {0, 0, 0, 0, 0},
        },
        //[11]空白
        {
        {-1, -1, 0, -1, -1},
        {-1, -1, 0, -1, -1},
        {-1, -1, 0, -1, -1},
        {-1, -1, 0, -1, -1},
        {-1, -1, 0, -1, -1},
        },
///////////////////////////////////////////
        //[12]A
        {
        {0, 1, 1, 0, -1},
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {1, 1, 1, 1, -1},
        {1, 0, 0, 1, -1},
        },
        //[13]D
        {
        {1, 1, 1, 0, -1},
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {1, 1, 1, 0, -1},
        },
        //[14]E
        {
        {1, 1, 1, 1, -1},
        {1, 0, 0, 0, -1},
        {1, 1, 1, 0, -1},
        {1, 0, 0, 0, -1},
        {1, 1, 1, 1, -1},
        },
        //[15]F
        {
        {1, 1, 1, 1, -1},
        {1, 0, 0, 0, -1},
        {1, 1, 1, 0, -1},
        {1, 0, 0, 0, -1},
        {1, 0, 0, 0, -1},
        },
        //[16]H
        {
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {1, 1, 1, 1, -1},
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        },
        //[17]I
        {
        {1, 1, 1, -1, -1},
        {0, 1, 0, -1, -1},
        {0, 1, 0, -1, -1},
        {0, 1, 0, -1, -1},
        {1, 1, 1, -1, -1},
        },
        //[18]M
        {
        {1, 0, 0, 0, 1},
        {1, 1, 0, 1, 1},
        {1, 0, 1, 0, 1},
        {1, 0, 0, 0, 1},
        {1, 0, 0, 0, 1},
        },
        //[19]N
        {
        {1, 0, 0, 0, 1},
        {1, 1, 0, 0, 1},
        {1, 0, 1, 0, 1},
        {1, 0, 0, 1, 1},
        {1, 0, 0, 0, 1},
        },
        //[20]O
        {
        {0, 1, 1, 0, -1},
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {0, 1, 1, 0, -1},
        },
        //[21]P
        {
        {1, 1, 1, 0, -1},
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {1, 1, 1, 0, -1},
        {1, 0, 0, 0, -1},
        },
        //[22]R
        {
        {1, 1, 1, 0, -1},
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {1, 1, 1, 0, -1},
        {1, 0, 0, 1, -1},
        },
        //[23]S
        {
        {0, 1, 1, 1, -1},
        {1, 0, 0, 0, -1},
        {0, 1, 1, 0, -1},
        {0, 0, 0, 1, -1},
        {1, 1, 1, 0, -1},
        },
        //[24]T
        {
        {1, 1, 1, 1, 1},
        {0, 0, 1, 0, 0},
        {0, 0, 1, 0, 0},
        {0, 0, 1, 0, 0},
        {0, 0, 1, 0, 0},
        },
        //[25]U
        {
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {1, 0, 0, 1, -1},
        {0, 1, 1, 0, -1},
        },
        //[26]W
        {
        {1, 0, 0, 0, 1},
        {1, 0, 0, 0, 1},
        {1, 0, 1, 0, 1},
        {1, 0, 1, 0, 1},
        {0, 1, 0, 1, 0},
        },
        ///////////////////////////
        //[27]スラッシュ
        {
        {0, 0, 0, 0, 1},
        {0, 0, 0, 1, 0},
        {0, 0, 1, 0, 0},
        {0, 1, 0, 0, 0},
        {1, 0, 0, 0, 0},
        },
        //[28]空白文字//曜日が切り替わる時、表示が残るのを防ぐ
        {
        {0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0},
        {0, 0, 0, 0, 0},
        },
    };


    

    //下のforを改行した後2回実行?

    //出力[size(時分秒)]
    for (int i = 0; i < 5; i++) {
        //size(縦幅5*size)
        for (int j = 0; j < size; j++) {
            //全文字分の行を構成 HMSdata[0-14]
            for (int k = 0; k < 15; k++) {
                //１文字分の行を構成
                for (int l = 0; l < 5; l++) {
                    //size(横幅5*size)
                    for (int m = 0; m < size; m++) {
                        if (bigList[HMSdata[k]][i][l] == 1) {
                            printf("■\033[3%dm", color);
                        } else if (bigList[HMSdata[k]][i][l] == 0) {
                            putchar(' ');
                        }
                    }
                }
            }
            putchar('\n');
        }
    }
    
    if (size != 1) {
        putchar('\n');//1行空ける
        //出力[曜日]
        for (int i = 0; i < 5; i++) {
            //全文字分の行を構成 YMDWdata[0-27]
            for (int j = 0; j < 28; j++) {
                //1文字分の行を構成
                for (int k = 0; k < 5; k++) {
                    if (bigList[YMDWdata[j]][i][k] == 1) {
                        printf("■\033[3%dm", color);
                    } else if (bigList[YMDWdata[j]][i][k] == 0) {
                        putchar(' ');
                    }
                }
            }
            putchar('\n');
        }
    }
}

